driver-tests/bpelse/assign/CopyByValue/CopyByValueJbi/test/MessageLevelCopy2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cop="http://j2ee.netbeans.org/wsdl/CopyTestWsdl">
  <soapenv:Body>
    <cop:PartElement>
      <TestElement>Element 1 Correct Value</TestElement>
      <TestElement2>Element 2 Correct Value</TestElement2>
    </cop:PartElement>
  </soapenv:Body>
</soapenv:Envelope>