driver-tests/bpelse/assign/CopyByValue/CopyByValueJbi/test/LeafLevelCopy/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <someNS:PartElement xmlns:someNS="http://j2ee.netbeans.org/wsdl/CopyTestWsdl">
      <TestElement xmlns="">Input Value 1</TestElement>
    </someNS:PartElement>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
